Repository: adslbarxatov/FontFinder
Catalog: src/FontFinder_*.resx
Languages: ru_ru

# BExitText
source: E&xit
ru_ru: В&ыход

# BSkippingText
source: Skipping
ru_ru: Пропуск

# CBoldText
source: &Bold
ru_ru: &Жирный

# CItalicText
source: &Italic
ru_ru: &Курсив

# ClearSkippingFonts
source: Clear list of skipping fonts?
ru_ru: Очистить список пропускаемых шрифтов?

# CStrikeText
source: Striked &out
ru_ru: &Зачёркнутый

# CUnderText
source: &Underlined
ru_ru: &Подчёркнутый

# EmptyTextField
source: Text field should not be empty. Enter text to view the font
ru_ru: Поле текста не должно быть пустым. Укажите текст для просмотра шрифта

# FileIsNotAnImage
source: Specified file is not a valid image
ru_ru: Указанный файл не является допустимым изображением

# FileNotFound
source: Specified file is unavailable for opening
ru_ru: Указанный файл не найден или недоступен

# FinishSearch
source: Finish the search?
ru_ru: Завершить поиск?

# HelpText
source: Quick user guide 1. It is recommended to use contrast pictures with dark text and bright background without other elements). Text must be flat (without trajectories). Cropped image will be shown in the field below the image selection button. 2. It is necessary to specify the text from the picture (it's case sensitive). This version of application allows non-empty text strings no longer than {0:D} characters. 3. In some cases these parameters may significantly change results of search. Specify them if you haven't received needed fonts. 4. If you want to pause search when you get the specified percentage of similarity (between {1:D} and {2:D}). 'Search' button starts fonts matching with sample image. 5. After search complete you'll get a list of most matching fonts (no more than {3:D}). By clicking you can see specified text in selected font and style. Search may be too long. Use '×' button to finish it immediately and view current results. 6. Application will add fonts that give the same comparison results to skipping list. It will increase search speed. You can change it manually if needed or turn off using corresponding flag
ru_ru: Краткое руководство пользователя 1. Рекомендуется использование контрастных изображений, на которых тёмный текст расположен на светлом фоне, и кроме него ничего нет. Текст должен быть ровным (без траекторий). Обрезанное до границ текста изображение будет отображено в поле ниже кнопки выбора картинки. 2. Для подбора шрифта необходимо указать текст, изображённый на картинке, с учётом регистра. В данной версии программы текст не может быть длиннее {0:D} символов. Одновременно он не может отсутствовать. 3. В некоторых случаях параметры шрифта существенно влияют на его отображение. Укажите эти параметры, если поиск не даёт желаемых результатов. 4. Если вы хотите, чтобы поиск был прерван при обнаружении совпадения с некоторым порогом, можно установить соответствующий флажок. Порогом срабатывания этого правила служит число от {1:D} до {2:D} процентов. Нажатие кнопки «Поиск» запустит перебор шрифтов на предмет совпадения с тем, который использован в загруженном изображении. 5. По окончании поиска в списке будет отображено не более {3:D} наиболее подходящих шрифтов и степени их совпадения с оригиналом в процентах. Щелчок по любому результату позволяет отобразить заданный ранее текст с использованием выбранного шрифта и стиля. Поиск может занимать значительное время. Используйте кнопку «×», чтобы остановить поиск и просмотреть уже имеющиеся результаты. 6. Приложение добавит шрифты, которые дают одинаковые результаты сравнения, в список пропуска. Это увеличит скорость поиска. При необходимости вы можете изменить его вручную или отключить, используя соответствующий флажок

# Label02Text
source: 2. Specify text from the picture:
ru_ru: 2. Укажите текст, содержащийся на изображении:

# Label03Text
source: 3. Specify expected font style and stop-factor:
ru_ru: 3. Укажите предполагаемый стиль и требуемый стоп-фактор:

# Label05Text
source: 5. Results (in descending order of similarity's degree):
ru_ru: 5. Результаты (по степени совпадения с образцом):

# Label06Text
source: % match
ru_ru: %-ное совпадение

# LargePicture
source: Loaded picture exceeds recommended dimensions. Processing may take significant time
ru_ru: Загруженное изображение превышает рекомендуемые размеры. Обработка может занять значительное время

# OpenImageFilter
source: Images
ru_ru: Изображения

# OpenImageTitle
source: Select an image file
ru_ru: Выберите файл изображения

# PauseSearchText
source: P&ause search if found
ru_ru: П&риостанавливать поиск, если найдено

# ProcessingMessage
source: Processing {0:D} from {1:D}: {2:S}
ru_ru: Обрабатывается {0:D} из {1:D}: {2:S}

# ProcessingStyle
source: with style {0:S}
ru_ru: со стилем {0:S}

# SelectImageText
source: 1. Select font's &picture
ru_ru: 1. Укажите &изображение с образцом шрифта

# ShowVideo
source: Do you want to view user videoguide on our YouTube channel?
ru_ru: Показать видеоруководство пользователя на нашем YouTube-канале?

# SkipListProcessorCaption
source: Skipping fonts
ru_ru: Пропускаемые шрифты

# SpecifyTextFromImage
source: Specify text from the sample image
ru_ru: Укажите текст с загруженного изображения

# StartSearchText
source: 4. Begin &search
ru_ru: 4. &Начните поиск

# WrongFont
source: Specified font is unavailable
ru_ru: Выбранный шрифт недоступен

# FillingRequiredText
source: Filling required
ru_ru: Требуется заполнение

# ExistentLabelText
source: Existent fonts ({0:D}):
ru_ru: Доступные шрифты ({0:D}):

# SkippingLabelText
source: Skipping fonts ({0:D}):
ru_ru: Пропускаемые шрифты ({0:D}):

# SampleText
source: SaMpLe 123
ru_ru: ОбРаЗеЦ 123
